{"name":"Lorenzo Orio","headerTaglineOne":"Hello 👋","headerTaglineTwo":"I'm Lorenzo,","headerTaglineThree":"Cybersecurity and Software Engineer","headerTaglineFour":"I also love planes ✈️","showCursor":true,"showBlog":true,"darkMode":true,"showResume":true,"socials":[{"id":"1","title":"Github","link":"https://github.com/loty2019","logo":"https://upload.wikimedia.org/wikipedia/commons/thumb/9/91/Octicons-mark-github.svg/2048px-Octicons-mark-github.svg.png"},{"id":"2","title":"LinkedIn","link":"https://www.linkedin.com/in/lorenzo-orio/","logo":"https://upload.wikimedia.org/wikipedia/commons/c/ca/LinkedIn_logo_initials.png"},{"id":"5","title":"Email","link":"mailto:lorenzo.orio@icloud.com","logo":"https://cdn-icons-png.flaticon.com/512/542/542689.png"}],"projects":[{"id":"1","title":"Wiser Plus 📚","description":"An open-source browser extension for a quick professor and course rating look up, directly in the school system when signing up for new classes using Typescript, Plasmo and RateMyProff API. With over 60 active users on the Chrome Store. ","imageSrc":"/images/wiserLogo.png","url":"https://chromewebstore.google.com/detail/wiser-plus/ijkpfmlggocjdpcfnhjblklabhgjochl?hl=en","github":"https://github.com/loty2019/wiser-plus"},{"id":"ebd89760-6b5a-4f1a-a95d-c61a051aa9eb","title":"Water Hub 💧","description":"A project developed on the ESP32 platform that makes the fridge and life smarter. Built to automatically fill up anything me and my roommates use to drink and track the intake of the fluids. Thanks to a Firebase database and a Web-App, it provides outside-the-house tracking, feedback, and visualization of intake to always stay on track with water consumption.","imageSrc":"https://water-dispenser-web.vercel.app/_next/image?url=%2F_next%2Fstatic%2Fmedia%2FWaterHub.f26720d1.png&w=256&q=75","url":"https://water-dispenser-web.vercel.app/","github":"https://github.com/loty2019/RefrigeratorWaterDispenser"},{"id":"72245d1d-738a-4f9e-8144-e041fd512b7a","title":"Parrot 🦜🏴‍☠️","description":"An open-source browser extension developed on Plasmo for media enthusiasts that easily provides trailers, multiple reviews, posters, and much more withing the websites. Specifically designed to work on multiple torrents websites. The extension also comes with other features such as bad file detection, UHD detection, and more, these features can be easily set by the user to make the experience more personalized. I do not host any copyrighted material I only use publicly available data.","imageSrc":"https://github.com/loty2019/Parrot/assets/125715080/7267d0c2-4ebf-404f-bee5-34651b1dd3c4","url":"https://loty2019.github.io/Parrot/","github":"https://github.com/loty2019/Parrot"},{"id":"392f7384-5716-46e1-9f00-53e63eca4905","title":"Enterprise-Grade Homelab 💾","description":"A geo-redundant homelab using Proxmox and Kubernetes with high-availability clustering, backed by ZFS on TrueNAS and VLAN segmentation via pfSense. Deployed GitLab CI/CD, SonarQube, and Vault for secure DevOps pipelines. Automated Active Directory, backups, and infrastructure provisioning using Ansible and Terraform. Monitored via Prometheus and Grafana, serving 25 active users. Runs on dual Xeon nodes with ECC memory, SSD caching, and 10GbE networking for high-speed, fault-tolerant performance.","imageSrc":"/images/SCALE_Electric_Eel_Icon.png","url":"/serverSetup.html"},{"id":"80c44603-bbf6-4bfd-b758-62b56563b502","title":"Bio-Visual","description":"The Bio-Visual project is an advanced 3D virtual laboratory that provides an interactive and immersive environment for biological experimentation and learning. This project leverages cutting-edge web technologies to simulate real-world lab scenarios, making it ideal for educational purposes, training, or research demonstrations.","imageSrc":"https://github.com/loty2019/Bio-Visual/raw/main/models/image.png","url":"https://loty2019.github.io/Bio-Visual/","github":"https://github.com/loty2019/Bio-Visual"}],"services":[{"id":"e9a35419-cc33-4a9f-9207-d188939304af","title":"THE FUTURE IS NOW! by Bruno Siciliano","description":"I had the privilege of organizing an inspiring seminar titled \"The Future is Now! Robotics Meets AI & 5G\" at UMass Boston, featuring the esteemed professor Bruno Siciliano from the University of Naples Federico II. 🤖🧠📡\n\nThis event brought together students, faculty, and robotics enthusiasts to explore cutting-edge advancements at the intersection of robotics, artificial intelligence, and 5G technology. Professor Siciliano's insights into the future potential of these technologies were both thought-provoking and motivating. We discussed how these advancements are reshaping industries and creating new opportunities.\n\nA heartfelt thank you to Oracle, the Deans of Students, the Computer Science & Engineering Department, and our Student Robotics Club for their invaluable support in making this event a success. And, of course, our deepest appreciation to Bruno Siciliano for joining us and sharing his expertise. Events like these remind us of the incredible impact that collaboration and innovation can have on the future.\n\nLooking forward to more inspiring collaborations like this!\n"}],"aboutpara":"I’m a developer, tech enthusiast, and someone who’s always been curious about how things work—from the servers that keep the internet running to the planes flying overhead. Originally from Italy, I moved to the U.S. to study computer science and push myself out of my comfort zone. That decision shaped how I approach everything: with a mindset to explore, adapt, and build.\n\nI’ve worked on a bit of everything—web development, embedded systems, cloud infrastructure, and even automation projects for smart homes and servers. I run my own homelab, not just as a hobby, but as a way to simulate real-world production environments and stay sharp with tools like Kubernetes, TrueNAS, and Proxmox. When I’m not coding or tinkering with hardware, I’m probably reading about aviation systems or watching planes take off.\n\nI bring a mix of structured thinking and laid-back creativity. I believe in working hard but keeping things human—tech should be practical, clear, and honestly a little fun. Whether it’s solving a problem for a client or hacking on a side project, I care about doing things the right way and learning something new in the process.","resume":{"tagline":"I'm a software and cybersecurity engineer","description":"","experiences":[{"id":"1","dates":"June 2020 – September 2023","type":"Part Time","position":"Software Lab Intern @ Academy of Digital Odontostomatology (AIOD)","bullets":"Created and helped project-manage over 100 dental surgery cases utilizing software like Exocad and 3Shape. , Collaborated with a team of doctors and patients to ensure 100% of issues were identified early and solutions found in a proactive manner.","link":"https://www.youtube.com/channel/UCTPUMg9G-svM69QhS9HsxUg/videos"},{"id":"d495c23b-4f65-479a-9b8a-cfbc1c089725","dates":"September 2022 – September 2024","type":"Part Time","position":"Software Engineering Tutor @ University Of Massachusetts Boston ","bullets":"Supervised 30 students per week by actively tracking improvements design and development of both software and the students to deliver functional software projects. , Held weekly group session boosting teamwork and collaborative learning by at least 50%.","link":"https://www.umb.edu/science-mathematics/student-success-center/"},{"id":"077dea00-439e-49ae-a625-5b11ba315308","dates":"September 2023 – September 2024","type":"Part Time","position":"Course Assistant for Data Structures and Algorithms @ University Of Massachusetts Boston ","bullets":"Assisting 60 students 4 times a week in learning data structure - syntax and algorithms in Python and Java. ,  Assisting in visualizing and approaching complex problems. Held interactive office hours increasing attendance by 20% and boosting students grades."},{"id":"54af5896-5bbf-471c-ab21-bf36343ad947","dates":"January 2025 – Present","type":"Full Time","position":"Cybersecurity Engineer Intern @ Weymouth Government ","bullets":"Led YubiKey MFA integration for Tyler ERP via ADFS replacing Entre ID; supported deployment planning secure provisioning and user training for 500+ municipal employees under a 3-month timeline., Tested and implemented YubiKey authentication across Fortinet VPN; Exchange 2019; and Windows logins; configured FortiAuthenticator and assisted in cross-platform secure login workflows and documentation."}],"activities":[{"id":"1","dates":"November 2024 ","type":"Vice President","position":"UMB Hackathon","bullets":"Organized and ran UMASS Boston Hackathon as technical lead planner reaching over 120 participants.","link":"https://hackumb.tech/"},{"id":"bc004b8a-90b8-4de0-bea2-ba9af7a91ab7","dates":"2021/22/23/24","type":"Volunteer","position":"Day of Action","bullets":"Volunteered to clean up Boston beaches and help grocery store packaging and support community.","link":"https://www.instagram.com/p/C_3mqoevJFc/?img_index=5"}],"education":{"universityName":"University of Massachusetts Boston ","universityDate":"2021-2025","universityPara":"• Dean’s List scholar (4x) • Navitas Merit Scholarships (2x) • UMB top 5% of class Scholarships • CS Research Fellowship • 3.8 GPA • Member of National Society of Leadership and Success (NSLS) • CS club Tech lead"},"languages":["Bilingual Italian","Bilingual English","Professional Spanish","Elementary German"],"programming":["Python","Java","C/C++","JavaScript","HTML/CSS","Typescript","R","Assembly","SQL"],"coursework":["Cybersecurity","Software Architecture","Internetworking","Graphics & Data Visualization","Advanced Algorithms"],"technologies":["React","Node.js","Pandas","WebGL","Three.js","Blender","Git","AWS","Docker","Firebase","D3","Vega lite","TensorFlow","Cloudflare","Proxmox","Kubernetes","Arduino","Next.js"]}}